/*
描述
用户输入N和K，然后接着输入N个正整数（无序的），程序在不对N个整数排序的情况下，找出第K大的数。注意，第K大的数意味着从大到小排在第K位的数。

输入
N
K
a1 a2 a3 a4 ..... aN

输出
b

样例输入
5
2
32 3 12 5 89

样例输出
32
*/
#include <iostream>
using namespace std;

int main()
{
    int n = 0, k = 0;
    int a[100];
    cin >> n >> k;
    /****************输入数据********************/
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
    }
    /****************利用排序法找出第k大的数********************/
    for (int i = 0; i < k; i++)
    {
        for (int j = i; j < n; j++)
        {
            if (a[i] > a[j])
            {
                int tmp = a[j];
                a[j] = a[i];
                a[i] = tmp;
            }
        }
    }
    /****************输出结果********************/
    cout << a[k-1] << endl;
    system("pause");
    return 0;
}
//机器评判通过,可惜的是这是通过排序后得出的结果