/*
描述
从键盘输入一指定金额（以元为单位，如345），然后输出支付该金额的各种面额的人民币数量，
显示100元，50元，20元，10元，5元，1元各多少张，要求尽量使用大面额的钞票。

输入
一个小于1000的正整数。

输出
输出分行，每行显示一个整数，从上到下分别表示100元，50元，20元，10元，5元，1元人民币的张数

样例输入
735

样例输出
7
0
1
1
1
0
*/
#include<iostream>
using namespace std;

int main() {
    int n;
    int num_100=0,
        num_50=0,
        num_20=0,
        num_10=0,
        num_5=0,
        num_1=0;
    cin>>n;
    if(n/100 > 0){
        num_100 = n/100;
        if(n%100 >= 50){
            num_50 = 1;
            if(n%100 - 50 >=20){
                num_20 = (n%100 - 50)/20;
                num_10 = (n%100 - 50 - num_20*20)/10;
            }else{
                num_10 = (n%100 - 50 - num_20*20)/10;
            }              
        }else if(n%100 >= 20 && n%100 < 50){
            num_20 = n%100/20;
            num_10 = (n%100 - n%100/20*20)/10;
        }else{
            num_10 = (n%100 - n%100/20*20)/10;
        }
        if(n%100%10 >= 5){
            num_5 = 1;
            num_1 = n%100%10 - num_5*5;
        }else{
            num_1 = n%100%10;
        }        
    }else{
        if(n%100 >= 50){
            num_50 = 1;
            if(n%100 - 50 >=20){
                num_20 = (n%100 - 50)/20;
                num_10 = (n%100 - 50 - num_20*20)/10;
            }else{
                num_10 = (n%100 - 50 - num_20*20)/10;
            }              
        }else if(n%100 >= 20 && n%100 < 50){
            num_20 = n%100/20;
            num_10 = (n%100 - n%100/20*20)/10;
        }else{
            num_10 = (n%100 - n%100/20*20)/10;
        }
        if(n%100%10 >= 5){
            num_5 = 1;
            num_1 = n%100%10 - num_5*5;
        }else{
            num_1 = n%100%10;
        } 
    }
    cout<<num_100<<endl;
    cout<<num_50<<endl;
    cout<<num_20<<endl;
    cout<<num_10<<endl;
    cout<<num_5<<endl;
    cout<<num_1<<endl;
    system("pause");
    return 0;
}
//机器评判通过